w7d2/jaron_lee/build_rails_project/BlogApp/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Day 3 - BEST DAY!"], ["body", "best day evar"], ["author_id", 146], ["created_at", "2020-07-14 17:04:00.111349"], ["updated_at", "2020-07-14 17:04:00.111349"]]
INSERT INTO "blogs" ("title", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "saddassad"], ["author_id", 1], ["body", "sdaadsdsasda"], ["created_at", "2019-09-20 23:06:21.734593"], ["updated_at", "2019-09-20 23:06:21.734593"]]
---
    def create
        blog = Blog.create(blog_params)
        if blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 72]]
---
    def destroy
        blog = Blog.find(params[:id])
        blog.destroy