w7d2/jaron_lee/build_rails_project/BlogApp/app/controllers/comments_controller.rb

    def create
        comment = Comment.create(params.require(:comment).permit(:body, :author_id, :blog_id))
        if comment.save
---
INSERT INTO "comments" ("body", "author_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asddsaads"], ["author_id", 1], ["blog_id", 1], ["created_at", "2019-09-20 23:06:30.115347"], ["updated_at", "2019-09-20 23:06:30.115347"]]