w6d5/99_cats_2/cats_project/app/controllers/cats_controller.rb

INSERT INTO "cats" ("age", "color", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["age", 2], ["color", "brown"], ["name", "bob"], ["created_at", "2020-07-16 03:21:19.875915"], ["updated_at", "2020-07-16 03:21:19.875915"]]
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def update
        @cat = Cat.find(params[:id])