w8d1/reddit_clone/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "post1"], ["content", "post1 content"], ["sub_id", 3], ["author_id", 2], ["created_at", "2020-07-20 18:41:56.854747"], ["updated_at", "2020-07-20 18:41:56.854747"]]