w8d1/reddit_clone/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Valorant"], ["description", "wall hacks"], ["moderator_id", 2], ["created_at", "2020-07-20 18:33:26.164147"], ["updated_at", "2020-07-20 18:33:26.164147"]]
---
    def create
        @sub = current_user.subs.new(sub_params)
        # @sub.moderator_id = params[:moderator_id]
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "sub3"], ["description", "asdfasdfasdf"], ["updated_at", "2020-07-20 18:47:14.780417"], ["id", 3]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)