w8d1/reddit_clone/reddit_clone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        @user = User.find(params[:id])
        if current_user == @user
            @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$NzSU/o48DGzCxiD3DG/s3u7Qe9KxmnwRnj3bVltS.iSlKhCTcwKnm"], ["updated_at", "2020-07-20 17:06:59.872055"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user == current_user
            @user.update(user_params)